Merge pull request #1 from fangxiao/feat/m0-scaffold
Feat/m0 scaffold
